Revit 2026 API

# TileTileHorizontalGap Property

---

The property labeled "Gap Width" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileHorizontalGap { get; }
```
```vb
Public Shared ReadOnly Property TileHorizontalGap As String
	Get
```
```cpp
public:
static property String^ TileHorizontalGap {
	String^ get ();
}
```
```fsharp
static member TileHorizontalGap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace